# Напишите программу, которая определяет наименьшее из двух чисел.
#
# Формат входных данных
# На вход программе подаётся два различных целых числа.
#
# Формат выходных данных
# Программа должна вывести наименьшее из двух чисел.
num = int(input())
num2 = int(input())
if num < num2:
    print(num)
else:
    print(num2)
